app/Controllers/ImsControllers/Inventary_transaction/stocks.php

    public function stocks_data() {
        $model = new StockModel();
        $data = $model->findAll();
---
SELECT *
FROM `stocks`