app/Controllers/ImsControllers/about.php

SELECT *
FROM `about_page_content`
 LIMIT 1
---
    public function index()
    {
        // Check if user is logged in
        if (!session()->has('user')) {
            return redirect()->to(site_url('ims/login'))->with('error', 'Please login to access the about.');
        }

        // Load the model and fetch the content
        $model = new AboutPageContentModel();
        $aboutContent = $model->first(); // Assuming you only have one record for the about page content