app/Controllers/ImsControllers/Dashboard_controller.php

    public function index()
    {
        $stockModel = new StockModel();
        $purchaseModel = new PurchaseModel();
        $salesModel = new SalesOrderModel();

        // Fetch total number of products
        $totalProducts = $stockModel->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `stocks`
WHERE `count` < 10