app/Controllers/ImsControllers/Dashboard_controller.php

    public function index()
    {
        // Check if user is logged in
        if (!session()->has('user')) {
            return redirect()->to(site_url('ims/login'))->with('error', 'Please login to access the dashboard.');
        }

        // If user is logged in, fetch dashboard data
        $stockModel = new StockModel();
        $salesModel = new SalesModel();
        $purchaseModel = new PurchaseOrderModel();
        $itemModel = new ItemModel();
        $supplierModel = new SupplierModel();
        $documentModel = new DocumentModel();
        $warehouseModel = new WarehouseModel();

        $data = [
            'stocks' => $stockModel->findAll(),
            'sales' => $salesModel->findAll(),
            'purchases' => $purchaseModel->findAll(),
            'items' => $itemModel->findAll(),
            'suppliers' => $supplierModel->findAll(),
            'documents' => $documentModel->findAll(),
            'warehouses' => $warehouseModel->findAll(),
        ];
---
SELECT *
FROM `stock`
SELECT *
FROM `purchase_orders`
SELECT *
FROM `warehouses`
SELECT *
FROM `documents`