app/Controllers/ImsControllers/GraphController.php

SELECT *
FROM `stock`
---
    public function stock_graph()
    {
        // Check if user is logged in
        if (!session()->has('user')) {
            return redirect()->to(site_url('ims/login'))->with('error', 'Please login to access the dashboard.');
        }

        // If user is logged in, fetch dashboard data
        $stockModel = new StockModel();

        // Fetch data for statistics
        $data = [
            'stocks' => $stockModel->findAll()
        ];

SELECT *
FROM `items`
---
    public function items_graph()
    {
        // Check if user is logged in
        if (!session()->has('user')) {
            return redirect()->to(site_url('ims/login'))->with('error', 'Please login to access the dashboard.');
        }

        // If user is logged in, fetch dashboard data
        $itemModel = new ItemModel();

        // Fetch data for statistics
        $data = [
            'items' => $itemModel->findAll()
        ];