app/Controllers/ImsControllers/PurchaseController.php

    public function purchase_data()
    {
        $model = new PurchaseOrderModel();

        // Get jqGrid parameters
        $page = $this->request->getVar('page', FILTER_VALIDATE_INT) ?: 1;
        $limit = $this->request->getVar('rows', FILTER_VALIDATE_INT) ?: 20;
        $sidx = $this->request->getVar('sidx') ?: 'order_id';
        $sord = $this->request->getVar('sord') ?: 'asc';
        $search = $this->request->getVar('_search') == 'true';

        // Build the query with sorting
        $model->orderBy($sidx, $sord);

        // Handle search filters
        if ($search) {
            $filters = json_decode($this->request->getVar('filters'), true);
            if (isset($filters['rules']) && is_array($filters['rules'])) {
                foreach ($filters['rules'] as $rule) {
                    $model->like($rule['field'], $rule['data']);
                }
            }
        }

        // Get the count of all records (for pagination)
        $count = $model->countAllResults(false);
---
SELECT COUNT(*) AS `numrows`
FROM `purchase_orders`