app/Controllers/ImsControllers/stocks.php

    public function stock_data()
    {
        // Check if user is logged in
        if (!session()->has('user')) {
            return $this->response->setJSON(['error' => 'Please login to access the stocks.']);
        }

        $model = new StockModel();

        // Get jqGrid parameters
        $page = $this->request->getVar('page', FILTER_VALIDATE_INT) ?: 1;
        $limit = $this->request->getVar('rows', FILTER_VALIDATE_INT) ?: 20;
        $sidx = $this->request->getVar('sidx') ?: 'id';
        $sord = $this->request->getVar('sord') ?: 'asc';
        $search = $this->request->getVar('_search') == 'true';

        // Build the query with sorting
        $model->orderBy($sidx, $sord);

        // Handle search filters
        if ($search) {
            $filters = json_decode($this->request->getVar('filters'), true);
            if (isset($filters['rules']) && is_array($filters['rules'])) {
                foreach ($filters['rules'] as $rule) {
                    $model->like($rule['field'], $rule['data']);
                }
            }
        }

        // Get the count of all records (for pagination)
        $count = $model->countAllResults(false);
---
SELECT COUNT(*) AS `numrows`
FROM `stock`