app/Controllers/ImsControllers/SuppliersController.php

    public function index()
    {
        $model = new SupplierModel();
        $data['suppliers'] = $model->findAll();
---
SELECT *
FROM `suppliers`