app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'abhinav0000'
 LIMIT 1
---
    public function getUserByUsername($username)
    {
        return $this->where('username', $username)->first();

INSERT INTO `users` (`username`, `password`, `email`, `fullname`, `dob`) VALUES ('sania123', '$2y$10$gtCAORAD.sHmjUE9LSFisuoNBGqp.wx3jV6DmG7WylKXQXw6sGolu', 'sania@gmail.com', 'sania m.', '2002-01-12')
---
    public function addUser($data)
    {
        if ($this->insert($data)) {